##  insert

In [1]:
import pandas as pd
import numpy as np

In [ ]:
df.insert(index_number, column_name,value, allow_duplicates=True)

In [ ]:
df.duplicated()

In [ ]:
df.drop_duplicates()

In [2]:
df = pd.DataFrame({'a':[10,20,30],'b':[1,2,3],'c':[100,200,300]})
df

    a  b    c
0  10  1  100
1  20  2  200
2  30  3  300

In [3]:
df.insert(1, 'd',1000)

In [5]:
df.insert(1,'d',2000,allow_duplicates=True)
df

    a     d     d  b    c
0  10  2000  1000  1  100
1  20  2000  1000  2  200
2  30  2000  1000  3  300

In [6]:
df.insert(4, 'e', 500, allow_duplicates=True)
df

    a     d     d  b    e    c
0  10  2000  1000  1  500  100
1  20  2000  1000  2  500  200
2  30  2000  1000  3  500  300

In [7]:
df = pd.DataFrame({'a':[10,20,30],'b':[1,2,3],'c':[100,200,300]})
df

    a  b    c
0  10  1  100
1  20  2  200
2  30  3  300

In [9]:
df.insert(2, 'd',[2,4,6],allow_duplicates=True)
df

    a  b  d    c
0  10  1  2  100
1  20  2  4  200
2  30  3  6  300

In [10]:
df.insert(2, 'new', 'Python',allow_duplicates=True)
df

    a  b     new  d    c
0  10  1  Python  2  100
1  20  2  Python  4  200
2  30  3  Python  6  300

In [11]:
df.loc[:,['a','b','d']]

    a  b  d
0  10  1  2
1  20  2  4
2  30  3  6

In [14]:
df[['a','b','d']]

    a  b  d
0  10  1  2
1  20  2  4
2  30  3  6

## Rename Column Names

In [15]:
df

    a  b     new  d    c
0  10  1  Python  2  100
1  20  2  Python  4  200
2  30  3  Python  6  300

In [17]:
df.rename({'a':'A','b':'B','new':'E'},axis=1)

    A  B       E  d    c
0  10  1  Python  2  100
1  20  2  Python  4  200
2  30  3  Python  6  300

In [20]:
df.columns = ['A',"B",'E','d','c']
df

    A  B       E  d    c
0  10  1  Python  2  100
1  20  2  Python  4  200
2  30  3  Python  6  300

In [21]:
df

    A  B       E  d    c
0  10  1  Python  2  100
1  20  2  Python  4  200
2  30  3  Python  6  300

In [22]:
df.rename(columns={'A':'a','B':'b','E':'new'})

    a  b     new  d    c
0  10  1  Python  2  100
1  20  2  Python  4  200
2  30  3  Python  6  300